{"format": "layers-model", "generatedBy": "keras v2.14.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.14.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "conv2d_input"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 224, 224, 3], "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of92.bin", "group1-shard2of92.bin", "group1-shard3of92.bin", "group1-shard4of92.bin", "group1-shard5of92.bin", "group1-shard6of92.bin", "group1-shard7of92.bin", "group1-shard8of92.bin", "group1-shard9of92.bin", "group1-shard10of92.bin", "group1-shard11of92.bin", "group1-shard12of92.bin", "group1-shard13of92.bin", "group1-shard14of92.bin", "group1-shard15of92.bin", "group1-shard16of92.bin", "group1-shard17of92.bin", "group1-shard18of92.bin", "group1-shard19of92.bin", "group1-shard20of92.bin", "group1-shard21of92.bin", "group1-shard22of92.bin", "group1-shard23of92.bin", "group1-shard24of92.bin", "group1-shard25of92.bin", "group1-shard26of92.bin", "group1-shard27of92.bin", "group1-shard28of92.bin", "group1-shard29of92.bin", "group1-shard30of92.bin", "group1-shard31of92.bin", "group1-shard32of92.bin", "group1-shard33of92.bin", "group1-shard34of92.bin", "group1-shard35of92.bin", "group1-shard36of92.bin", "group1-shard37of92.bin", "group1-shard38of92.bin", "group1-shard39of92.bin", "group1-shard40of92.bin", "group1-shard41of92.bin", "group1-shard42of92.bin", "group1-shard43of92.bin", "group1-shard44of92.bin", "group1-shard45of92.bin", "group1-shard46of92.bin", "group1-shard47of92.bin", "group1-shard48of92.bin", "group1-shard49of92.bin", "group1-shard50of92.bin", "group1-shard51of92.bin", "group1-shard52of92.bin", "group1-shard53of92.bin", "group1-shard54of92.bin", "group1-shard55of92.bin", "group1-shard56of92.bin", "group1-shard57of92.bin", "group1-shard58of92.bin", "group1-shard59of92.bin", "group1-shard60of92.bin", "group1-shard61of92.bin", "group1-shard62of92.bin", "group1-shard63of92.bin", "group1-shard64of92.bin", "group1-shard65of92.bin", "group1-shard66of92.bin", "group1-shard67of92.bin", "group1-shard68of92.bin", "group1-shard69of92.bin", "group1-shard70of92.bin", "group1-shard71of92.bin", "group1-shard72of92.bin", "group1-shard73of92.bin", "group1-shard74of92.bin", "group1-shard75of92.bin", "group1-shard76of92.bin", "group1-shard77of92.bin", "group1-shard78of92.bin", "group1-shard79of92.bin", "group1-shard80of92.bin", "group1-shard81of92.bin", "group1-shard82of92.bin", "group1-shard83of92.bin", "group1-shard84of92.bin", "group1-shard85of92.bin", "group1-shard86of92.bin", "group1-shard87of92.bin", "group1-shard88of92.bin", "group1-shard89of92.bin", "group1-shard90of92.bin", "group1-shard91of92.bin", "group1-shard92of92.bin"], "weights": [{"name": "conv2d/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "conv2d/bias", "shape": [32], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [64], "dtype": "float32"}, {"name": "dense/kernel", "shape": [186624, 512], "dtype": "float32"}, {"name": "dense/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [512, 5], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [5], "dtype": "float32"}]}]}